var ErrorCode = (function () {
    var f = {
        S0A00000: {
            code: 'S0A00000',
            msg: '操作成功'
        },
        //这里是一些通用的错误码，下面的是按模块区分的
        E1M000000: {
            code: 'E1M000000',
            msg: '请求参数不能为空'
        },
        E1M000001: {
            code: 'E1M000001',
            msg: '请求参数格式错误'
        },
        E1M000002: {
            code: 'E1M000002',
            msg: '系统异常，请稍候重试'
        },
        E1M000003: {
            code: 'E1M000003',
            msg: '请先登录'
        },
        E1M000004: {
            code: 'E1M000004',
            msg: '解密的key没有配置，请联系管理员'
        },
        E1M000005: {
            code: 'E1M000005',
            msg: '参数解密错误'
        },
        E1M000006: {
            code: 'E1M000006',
            msg: '短信发送类型错误'
        },
        user: {
            E1B02011: {
                code: "E1B02011",
                msg: 'loginTokenKey没有配置，请联系管理员'
            },
            E1B02012: {
                code: "E1B02012",
                msg: 'token解密出错,请检查token'
            },
            E1B02013: {
                code: "E1B02013",
                msg: '登录状态已过期，请重新登录'
            },
            E1B02014: {
                code: "E1B02014",
                msg: 'token解密出错，数据内容错误'
            },
            E1B02015: {
                code: "E1B02015",
                msg: '用户名或密码错误'
            },
            E1B02016: {
                code: "E1B02016",
                msg: '用户被冻结，不能登录，请联系客服!'
            },
            E1B02017: {
                code: "E1B02017",
                msg: '用户未设置密码，不能登录!'
            },
            E1B02018: {
                code: "E1B02018",
                msg: '未知错误，请联系客服!'
            },
            E1B02019: {
                code: "E1B02019",
                msg: '请发送短信验证码'
            },
            E1B02020: {
                code: "E1B02020",
                msg: '手机号码与接收短信手机号码不匹配'
            },
            E1B02021: {
                code: "E1B02021",
                msg: '短信验证码已过期'
            },
            E1B02022: {
                code: "E1B02022",
                msg: '短信验证码错误'
            },
            E1B02023: {
                code: "E1B02023",
                msg: '短信验证码错误'
            },
            E1B02024: {
                code: "E1B02024",
                msg: '该用户未注册'
            },
            E1B02025: {
                code: "E1B02025",
                msg: '密码长度只能是6到16位'
            },
            E1B02026: {
                code: "E1B02026",
                msg: '推广码不能填写自己'
            },
            E1B02027: {
                code: "E1B02027",
                msg: '推广码错误'
            },
            E1B02028: {
                code: "E1B02028",
                msg: '用户已存在，请直接登录'
            },
            E1B02029: {
                code: "E1B02029",
                msg: '密码长度只能是6到16位'
            },
            E1B02030: {
                code: "E1B02030",
                msg: '第三方登录类型非法'
            },
            E1B02032: {
                code: "E1B02032",
                msg: '旧密码错误'
            },
            E1B02033: {
                code: "E1B02033",
                msg: '绑定账号类型错误'
            },
            E1B02034: {
                code: "E1B02034",
                msg: '重复绑定'
            },
            E1B02035: {
                code: "E1B02035",
                msg: '新密码不能和旧密码一样'
            },
            E1B02036: {
                code: "E1B02036",
                msg: '密码长度只能是6-20位'
            },
            E1B02031: {
                code: "E1B02031",
                msg: '密码和确认密码不一致'
            },
            E1B02037: {
                code: "E1B02037",
                msg: '获取会员积分失败'
            },
            E1B02038: {
                code: "E1B02038",
                msg: '积分余额不足'
            },
            E1B02039: {
                code: "E1B02039",
                msg: '积分支付失败'
            },
            E1B02040: {
                code: "E1B02040",
                msg: '第三方登录操作类型非法'
            },
            E1B02041: {
                code: "E1B02041",
                msg: '该账号已经被绑定，不能重复绑定'
            },
            E1B02050: {
                code: "E1B02050",
                msg: '密码有误，请重新输入'
            },
            E1B02051: {
                code: "E1B02051",
                msg: '订单不支持积分支付'
            },
        },
        order: {
            E1M01001: {
                code: 'E1M01001',
                msg: 'serviceCode不能为空'
            },
            E1B01001: {
                code: 'E1B01001',
                msg: 'aliasCode不能为空'
            },
            E1Z01001: {
                code: 'E1Z01001',
                msg: 'Exception'
            },
            E1M01002: {
                code: 'E1M01002',
                msg: '订单已支付'
            },
            E1M01003: {
                code: 'E1M01003',
                msg: '订单不存在'
            },
            E1M01004: {
                code: 'E1M01004',
                msg: '您没有权限查看这个订单'
            },
            E1M01005: {
                code: 'E1M01005',
                msg: '重复提交支付'
            },
            E1M01006: {
                code: 'E1M01006',
                msg: '支付接口配置有误，请联系客服'
            },
            E1M01007: {
                code: 'E1M01007',
                msg: '您还没有选择配送地址，请选择配送地址后再提交'
            },
            E1M01008: {
                code: 'E1M01008',
                msg: '地址没有选择到最后一级'
            },
            E1M01009: {
                code: 'E1M01009',
                msg: '收货人姓名不能为空,请填写收货人姓名！'
            },
            E1M01010: {
                code: 'E1M01010',
                msg: '请选择支付方式！'
            },
            E1M01011: {
                code: 'E1M01011',
                msg: '请选择配送方式！'
            },
            E1M01012: {
                code: 'E1M01012',
                msg: '没有要结算的商品！'
            },
            E1M01013: {
                code: 'E1M01013',
                msg: '积分与购物券支付金额不能大于商品金额！'
            },
            E1M01014: {
                code: 'E1M01014',
                msg: '已支付金额不能大于订单总金额！'
            },
            E1M01015: {
                code: 'E1M01015',
                msg: '预付卡支付失败！'
            },
            E1M01016: {
                code: 'E1M01016',
                msg: '默认收货地址为空！'
            },
            E1M01017: {
                code: 'E1M01017',
                msg: '此卡已经被他人绑定！'
            },
            E1M01018: {
                code: 'E1M01018',
                msg: '非加密卡，不支持线上支付，可在自提点刷卡！'
            },
            E1M01019: {
                code: 'E1M01019',
                msg: 'serviceCode不正确'
            },
            E1M01020: {
                code: 'E1M01020',
                msg: '订单号错误'
            },
            E1M01021: {
                code: 'E1M01021',
                msg: '获取支付签名失败'
            },
            E1M01022: {
                code: 'E1M01022',
                msg: '当前订单的定金已支付，无需重复支付。'
            },
            E1M01023: {
                code: 'E1M01023',
                msg: '当前订单未支付定金，不支持付尾款。'
            },
            E1M01024: {
                code: 'E1M01024',
                msg: '当前订单已支付完成，无需重复支付。'
            },
            E1M01025: {
                code: 'E1M01025',
                msg: '当前预售订单不在定金缴纳和尾款缴纳的时间范围内。'
            },
            E1M01026: {
                code: 'E1M01026',
                msg: '支付金额必须大于等于0。'
            },
            E1M01027: {
                code: 'E1M01027',
                msg: '订单号不能为空'
            },
            E1M01028: {
                code: 'E1M01028',
                msg: '订单取消失败'
            },
            E1M01029: {
                code: 'E1M01029',
                msg: '重复取消订单'
            },
            E1M01030: {
                code: 'E1M01030',
                msg: '订单在当前状态不能取消'
            },
            E1M01031: {
                code: 'E1M01031',
                msg: '订单购物券已失效，请重新下单'
            },
            E1M01032: {
                code: 'E1M01032',
                msg: '积分支付金额不能大于订单总金额30%！'
            },
            E1M01033: {
                code: 'E1M01033',
                msg: '结算商品错误，不同类型商品不能同时结算！'
            },
            E1M01034: {
                code: 'E1M01034',
                msg: '请填写尾款通知手机号码'
            },
            E1M01035: {
                code: 'E1M01035',
                msg: '订单已取消'
            },
            E1M01036: {
                code: 'E1M01036',
                msg: '支付方式配置不正确'
            },
            E1M01037: {
                code: 'E1M01037',
                msg: '订单是货到付款订单，无需现在支付'
            },
            E1M01038: {
                code: 'E1M01038',
                msg: '超出试用订单积分使用限制'
            },
            E1M01039: {
                code: 'E1M01039',
                msg: '非试用订单，不能使用积分支付'
            }
        },
        product: {
            E1M00004: {
                code: 'E1M00004',
                msg: 'productId不能为空'
            },
            E1M00005: {
                code: 'E1M00005',
                msg: '商品不存在'
            },
            E1M00011: {
                code: 'E1M00011',
                msg: '没有此商品'
            },
            E1Z00002: {
                code: 'E1Z00002',
                msg: '程序异常'
            }
        },
        cart: {
            E1M050091: {
                code: 'E1M050091',
                msg: '购物车为空'
            },
            E1M050092: {
                code: 'E1M050092',
                msg: '商品不存在'
            },
            E1M050093: {
                code: 'E1M050093',
                msg: '有多款子商品，需要选择一款具体的商品购买。'
            },
            E1M050094: {
                code: 'E1M050094',
                msg: '商品库存不足'
            },
            E1M050095: {
                code: 'E1M050095',
                msg: '其他异常'
            },
            E1M050096: {
                code: 'E1M050096',
                msg: '该商品没有参加预售'
            },
            E1M050097: {
                code: 'E1M050097',
                msg: '商品不可买'
            },
            E1M050098: {
                code: 'E1M050098',
                msg: '商品已下架'
            },
            E1M050099: {
                code: 'E1M050099',
                msg: '预售已经开始支付尾款不，不能购买'
            },
            E1M050100: {
                code: 'E1M050100',
                msg: '预售已结束，不能购买'
            },
            E1M050101: {
                code: 'E1M050101',
                msg: '预售订金支付时间已过，不能购买'
            },
            E1M050102: {
                code: 'E1M050102',
                msg: '预售还没有开始，请稍候再来'
            },
            E1M050103: {
                code: 'E1M050103',
                msg: '预售规则未审核通过，不能购买'
            },
            E1M050104: {
                code: 'E1M050104',
                msg: '非ole商品，不能加入购物车'
            },
            E1M050105: {
                code: 'E1M050105',
                msg: '加入购物车失败'
            }
        },
        preSale: {
            E1M00001: {
                code: 'E1M00001',
                msg: 'serviceCode不能为空'
            },
            E1M00002: {
                code: 'E1M00002',
                msg: 'productId不能为空'
            },
            E1M00003: {
                code: 'E1M00003',
                msg: '没有找到该商品相关的预售规则'
            },
            E1Z00001: {
                code: 'E1Z00001',
                msg: '程序抛出异常'
            },
            E1B00001: {
                code: 'E1B00001',
                msg: '找不到相应的订单'
            },
            E1B00002: {
                code: 'E1B00001',
                msg: '该订单没有orderType字段'
            },
            E1B00003: {
                code: 'E1B00003',
                msg: '不在尾款支付时间范围'
            },
            E1B00004: {
                code: 'E1B00004',
                msg: '该订单没有支付订金，不能进行尾款支付'
            }
        },
        article: {
            E1B04001: {
                code: 'E1B04001',
                msg: '文章id不能问空'
            },
            E1B04002: {
                code: 'E1B04002',
                msg: '操作类型为空'
            },
            E1B04003: {
                code: 'E1B04003',
                msg: '评价内容为空'
            },
            E1B04004: {
                code: 'E1B04004',
                msg: '当前用户已点赞过此文章'
            },
            E1B04005: {
                code: 'E1B04005',
                msg: '当前用户没点过赞过'
            },
            E1B04006: {
                code: 'E1B04006',
                msg: '操作失败'
            },
            E1B04007: {
                code: 'E1B04007',
                msg: '当前用户已经评论过'
            },
            E1B04008: {
                code: 'E1B04008',
                msg: '当前用户已经收藏过'
            },
            E1B04009: {
                code: 'E1B04009',
                msg: '当前用户没登录'
            },
            E1B04010: {
                code: 'E1B04010',
                msg: '当前用户已经点赞过此评论'
            },
            E1B04011: {
                code: 'E1B04011',
                msg: '没有此评论'
            },
            E1B04012: {
                code: 'E1B04012',
                msg: '没有对此评论点赞'
            },
            E1B04013: {
                code: 'E1B04013',
                msg: '没有找到相应的数据'
            }
        },
        voucher: {
            E1B13001: {
                code: 'E1B13001',
                msg: '获取列表失败'
            },
            E1B13002: {
                code: 'E1B13002',
                msg: '券号不能为空'
            },
            E1B13003: {
                code: 'E1B13003',
                msg: '券号错误'
            },
            E1B13004: {
                code: 'E1B13004',
                msg: '券批次错误'
            },
            E1B13005: {
                code: 'E1B13005',
                msg: '券不能转赠'
            },
            E1B13006: {
                code: 'E1B13006',
                msg: '券还没有被领取'
            },
            E1B13007: {
                code: 'E1B13007',
                msg: '券已经过了有效期'
            },
            E1B13008: {
                code: 'E1B13008',
                msg: '券没有发起转赠'
            },
            E1B13009: {
                code: 'E1B13009',
                msg: '券已被领取'
            },
            E1B13010: {
                code: 'E1B13010',
                msg: '券已经发起转赠'
            },
            E1B13011: {
                code: 'E1B13011',
                msg: '券不能转赠给自己'
            },
            E1B13012: {
                code: 'E1B13012',
                msg: '券已被取消转赠'
            },
        },
        sms: {
            E1M060001: {
                code: 'E1M060001',
                msg: '未发送手机验证码给该手机'
            },
            E1M060002: {
                code: 'E1M060002',
                msg: '验证码错误'
            },
            E1M060003: {
                code: 'E1M060003',
                msg: '验证码已失效'
            },
            E1M060004: {
                code: 'E1M060004',
                msg: '验证码错误'
            },
            E1M060005: {
                code: 'E1M060005',
                msg: '参数签名不通过'
            },
            E1M060006: {
                code: 'E1M060006',
                msg: '短信类型不能为空'
            },
            E1M060007: {
                code: 'E1M060007',
                msg: '手机号码不能为空'
            },
            E1M060008: {
                code: 'E1M060008',
                msg: '手机号码格式错误'
            },
            E1M060009: {
                code: 'E1M060009',
                msg: '验证码不能为空'
            },
            E1M060010: {
                code: 'E1M060010',
                msg: '该手机号码尚未注册，请先注册'
            },
            E1M060011: {
                code: 'E1M060011',
                msg: '一分钟内只能发送一次'
            },
            E1M060012: {
                code: 'E1M060012',
                msg: '该号码已注册，请直接登录'
            },
            E1M060013: {
                code: 'E1M060013',
                msg: '短信发送失败'
            },
            E1M060014: {
                code: 'E1M060014',
                msg: '手机号码与接收短信手机号码不匹配'
            },
            E1M060015: {
                code: 'E1M060015',
                msg: '短信发送超出限制，请明天再来'
            },
        },
        region: {
            E1M070001: {
                code: 'E1M070001',
                msg: 'regionId错误，找到不这个地区'
            },
        },
        email: {
            E1M080001: {
                code: 'E1M080001',
                msg: '邮件发送失败'
            },
            E1M080002: {
                code: 'E1M080002',
                msg: '邮箱地址不匹配'
            },
            E1M080003: {
                code: 'E1M080003',
                msg: '邮箱格式错误'
            },
            E1M080004: {
                code: 'E1M080004',
                msg: '没有发送绑定邮件'
            },
            E1M080005: {
                code: 'E1M080005',
                msg: '重复绑定邮箱'
            },
        },
        notify: {
            E1M100001: {
                code: 'E1M100001',
                msg: '重复订阅通知'
            },
            E1M100002: {
                code: 'E1M100002',
                msg: '通知类型错误'
            },
            E1M100003: {
                code: 'E1M100003',
                msg: '订阅对象不能为空'
            },
            E1M100004: {
                code: 'E1M100004',
                msg: '活动已经开始了，不需要订阅'
            },
            E1M100005: {
                code: 'E1M100005',
                msg: '消息ID参数错误'
            },
            E1M100006: {
                code: 'E1M100006',
                msg: '消息已经读过了'
            },
            E1M100007: {
                code: 'E1M100007',
                msg: '您还没有订阅该通知'
            }
        },
        sfExchange: {
            E1C00001: {
                code: 'E1C00001',
                msg: '找不到顺丰物流配置信息'
            },
            E1C00002:{
                code:'E1C00002',
                msg: '顺丰接口调用错误'
            },
            E1C00003:{
                code:'E1C00003',
                msg: '暂无物流信息'
            },
            E1C00004:{
                code:'E1C00004',
                msg: '筛单失败'
            },
            E1C00005:{
                code:'E1C00005',
                msg: '获取Ole商家ID失败,未配置Ole商家ID'
            },
            E1C00006:{
                code:'E1C00006',
                msg: '当前订单不是Ole商家,不从顺丰下单'
            },
            E1C00007:{
                code:'E1C00007',
                msg: '请求顺丰接口超时'
            }
        },
        aftersale: {
            E1D00001: {
                code: 'E1D00001',
                msg: '找不到相应的退货单'
            },
            E1D00002: {
                code: 'E1D00002',
                msg: '联系人或者联系电话不能为空'
            },
            E1D00003: {
                code: 'E1D00003',
                msg: '找不到订单购买人信息'
            },
            E1D00004: {
                code: 'E1D00004',
                msg: '非法用户'
            },
            E1D00005: {
                code: 'E1D00005',
                msg: '找不到与该登录ID匹配的用户'
            },
            E1D00006: {
                code: 'E1D00006',
                msg: '添加退货单出现异常'
            },
            E1D00007: {
                code: 'E1D00007',
                msg: '找不到相应的退款单'
            },
            E1D00008: {
                code: 'E1D00008',
                msg: '退货单ID不能为空'
            },
            E1D00009: {
                code: 'E1D00009',
                msg: '运单号不能为空'
            },
            E1D00010: {
                code: 'E1D00010',
                msg: '物流商不能为空'
            },
            E1D00012:{
                code: 'E1D00012',
                msg: '退款单申请人与登录用户不一致'
            }
        },
        tryuse: {
            E1M110001: {
                code: 'E1M110001',
                msg: '试用活动不存在'
            },
            E1M110002: {
                code: 'E1M110002',
                msg: '试用活动渠道不匹配'
            },
            E1M110003: {
                code: 'E1M110003',
                msg: '试用活动已下架'
            },
        }
    };
    return f;
})();